var result = {
  "provinces":[
    {
      "name":"广东",
      "city":['广州','深圳','珠海']
    },
    {
      "name":"广西",
      "city":[] //罗列它的城市
    },
    {
      "name":"海南",
      "city":[] //罗列它的城市
    }
  ],
  "data":[
    {
      "id": "1",
      "latitude": "22.634104",
      "locate": "广东省深圳市龙岗区坂田街道吉华路696号嘉誉豪园1106A",
      "longitude": "114.059998",
      "name": "必胜客（坂田店）"
    },
    {
      "id": "2",
      "latitude": "22.518667",
      "locate": "广东省深圳市南山区南海大道与海德二道交汇海雅缤纷广场1-2楼",
      "longitude": "113.929253",
      "name": "必胜客（海雅店）"
    },
    {
      "id": "3",
      "latitude": "22.724449",
      "locate": "广东省深圳市龙岗区深圳海航城商业城商业广场",
      "longitude": "114.267120",
      "name": "必胜客（海航城店）"
    },
    {
      "id": "4",
      "latitude": "22.723791",
      "locate": "广东省深圳市龙岗区深圳海航城商业城商业广场",
      "longitude": "114.266907",
      "name": "必胜客"
    },
    {
      "id": "5",
      "latitude": "22.692892",
      "locate": "广东省深圳市坪山区益田假日世界L2-14-16号",
      "longitude": "114.339714",
      "name": "必胜客(坪山)"
    },
    {
      "id": "6",
      "latitude": "22.593927",
      "locate": "广东省深圳市龙岗区迎宾路与岭南街交汇处佳兆业广场内",
      "longitude": "114.475159",
      "name": "必胜客(佳兆业广场店)"
    },
    {
      "id": "7",
      "latitude": "22.520153",
      "locate": "广东省深圳市福田区金田路嘉意台裙楼1层",
      "longitude": "114.065109",
      "name": "必胜客(金田店)"
    },
    {
      "id": "8",
      "latitude": "22.767887",
      "locate": "广东省深圳市宝安区松岗街道松明大道南侧松岗佳华商场1栋1-2层",
      "longitude": "113.847168",
      "name": "松岗"
    },
    {
      "id": "9",
      "latitude": "22.553747",
      "locate": "广东省深圳市宝安区新安新湖路宝安新中心区壹方中心",
      "longitude": "113.887314",
      "name": "壹方城"
    },
    {
      "id": "10",
      "latitude": "21.431532",
      "locate": "广西壮族自治区北海市银海区广东南路万达广场必胜客欢乐餐厅",
      "longitude": "109.143929",
      "name": "必胜客（北海万达店）"
    },
    {
      "id": "11",
      "latitude": "20.016190",
      "locate": "海南省海口市美兰区国兴大道日月广场东区双鱼座C01商铺",
      "longitude": "110.351379",
      "name": "必胜客(日月广场店)"
    },
    {
      "id": "12",
      "latitude": "24.773594",
      "locate": "广西壮族自治区桂林市阳朔县德业楼",
      "longitude": "110.494064",
      "name": "必胜客(阳朔店)"
    },
    {
      "id": "13",
      "latitude": "22.713945",
      "locate": "广东省深圳市龙岗区龙翔大道7188号",
      "longitude": "114.242622",
      "name": "必胜客(万科广场店)"
    },
    {
      "id": "14",
      "latitude": "22.721848",
      "locate": "广东省深圳市龙岗区龙福西路与禾田路交汇处家和盛世花园二期1栋1/2层商铺",
      "longitude": "114.232063",
      "name": "必胜客(禾田店)"
    },
    {
      "id": "15",
      "latitude": "22.690973",
      "locate": "广东省深圳市龙岗区黄阁南路666号星河时代COCOPark2楼C-005-006铺(近深惠路)",
      "longitude": "114.229019",
      "name": "必胜客(星河时代PH店)"
    },
    {
      "id": "16",
      "latitude": "22.725243",
      "locate": "广东省深圳市龙岗区龙城街道龙福路珠江广场1-2层(龙岗中心城)",
      "longitude": "114.250961",
      "name": "必胜客(珠江广场店)"
    },
    {
      "id": "17",
      "latitude": "22.726793",
      "locate": "广东省深圳市龙岗区龙岗大道(龙岗段)6038",
      "longitude": "114.274513",
      "name": "必胜客(五洲风情店)"
    },
    {
      "id": "18",
      "latitude": "22.555920",
      "locate": "广东省深圳市盐田区深盐路与海山路交汇处壹海城1区1层",
      "longitude": "114.239090",
      "name": "必胜客(壹海城店)"
    },
    {
      "id": "19",
      "latitude": "22.676712",
      "locate": "广东省深圳市龙岗区国际大道奥特莱斯二楼",
      "longitude": "114.124290",
      "name": "必胜客(华南城店)"
    },
    {
      "id": "20",
      "latitude": "22.643208",
      "locate": "广东省深圳市龙岗区横岗街道横岗天虹1层",
      "longitude": "114.195793",
      "name": "必胜客(横岗天虹店)"
    },
    {
      "id": "21",
      "latitude": "22.646585",
      "locate": "广东省深圳市龙岗区横岗街裙楼商业首层",
      "longitude": "114.207596",
      "name": "必胜客(横岗店)"
    },
    {
      "id": "22",
      "latitude": "22.596910",
      "locate": "广东省深圳市盐田区大梅沙奥特莱斯购物村G栋1层",
      "longitude": "114.308922",
      "name": "必胜客(大梅沙店)"
    },
    {
      "id": "23",
      "latitude": "22.609505",
      "locate": "广东省深圳市盐田区大梅沙深圳东部华侨城大侠谷景区海菲德小镇9号楼",
      "longitude": "114.303650",
      "name": "必胜客(大侠谷店)"
    },
    {
      "id": "24",
      "latitude": "22.612810",
      "locate": "广东省深圳市龙岗区布吉街道大芬社区星都豪庭01层25-33号",
      "longitude": "114.137848",
      "name": "必胜客(大芬店)"
    },
    {
      "id": "25",
      "latitude": "22.549307",
      "locate": "广东省深圳市罗湖区中兴路29号大院1楼",
      "longitude": "114.129623",
      "name": "必胜客(中兴店)"
    },
    {
      "id": "26",
      "latitude": "22.598063",
      "locate": "广东省深圳市龙岗区锦龙路89万科红生活广场1层091~093",
      "longitude": "114.127571",
      "name": "必胜客(布吉万科红店)"
    },
    {
      "id": "27",
      "latitude": "22.545738",
      "locate": "广东省深圳市罗湖区解放路1034号鸿展广场2楼",
      "longitude": "114.119408",
      "name": "必胜客(鸿展店)"
    },
    {
      "id": "28",
      "latitude": "22.548054",
      "locate": "广东省深圳市罗湖区东门中路2071号南海中心2层",
      "longitude": "114.121750",
      "name": "必胜客(东门店)"
    },
    {
      "id": "29",
      "latitude": "22.544954",
      "locate": "广东省深圳市罗湖区深南东路5016号京基百纳空间KKMALLB1楼B105(近大剧院)",
      "longitude": "114.106651",
      "name": "必胜客(金融中心店)"
    },
    {
      "id": "30",
      "latitude": "22.540117",
      "locate": "广东省深圳市福田区深南中路3003号北方大厦1-2层",
      "longitude": "114.084641",
      "name": "必胜客(北方大厦店)"
    },
    {
      "id": "31",
      "latitude": "22.539072",
      "locate": "广东省深圳市罗湖区人民南路2028号金光华广场B1楼100-105号铺(南国影院对面)",
      "longitude": "114.119667",
      "name": "必胜客(金光华店)"
    },
    {
      "id": "32",
      "latitude": "22.541468",
      "locate": "广东省深圳市罗湖区深南中路华润中心万象城B01号商铺",
      "longitude": "114.111153",
      "name": "必胜客(万象城PH店)"
    },
    {
      "id": "33",
      "latitude": "22.539469",
      "locate": "广东省深圳市福田区深南中路1095号新城市广场2楼2001铺(近地铁科学馆站)",
      "longitude": "114.097893",
      "name": "必胜客(城市广场店)"
    },
    {
      "id": "34",
      "latitude": "22.500334",
      "locate": "广东省深圳市南山区中心路与工业八路交汇处宝能太古城宝能allcityB1层",
      "longitude": "113.939110",
      "name": "必胜客(宝能太古店)"
    },
    {
      "id": "35",
      "latitude": "22.540558",
      "locate": "广东省深圳市南山区科兴路10-2汇景豪苑1层(科技园区深南大道与科苑路交汇处)",
      "longitude": "113.942574",
      "name": "必胜客(科苑店)"
    },
    {
      "id": "36",
      "latitude": "22.534801",
      "locate": "广东省深圳市南山区南新路3022号欢乐颂1层花园广场",
      "longitude": "113.920349",
      "name": "必胜客欢乐餐厅(欢乐颂购物中心店)"
    },
    {
      "id": "37",
      "latitude": "22.560667",
      "locate": "广东省深圳市宝安区新湖路与罗田路交汇点处泰华君逸世家1层107号",
      "longitude": "113.881134",
      "name": "必胜客(新湖店)"
    },
    {
      "id": "38",
      "latitude": "22.581144",
      "locate": "广东省深圳市南山区留仙大道1376号南国丽城花园1栋101-1层",
      "longitude": "113.956551",
      "name": "必胜客(西丽店)"
    },
    {
      "id": "39",
      "latitude": "22.539099",
      "locate": "广东省深圳市南山区欢乐谷西班牙广场",
      "longitude": "113.978973",
      "name": "必胜客(欢乐餐厅店)"
    },
    {
      "id": "40",
      "latitude": "22.530478",
      "locate": "广东省深圳市南山区白石路2168号京基百纳广场(南山店)L1层L1-11",
      "longitude": "113.969803",
      "name": "必胜客(御景东方店)"
    },
    {
      "id": "41",
      "latitude": "22.557144",
      "locate": "广东省深圳市南山区北环大道8188号百安居1楼",
      "longitude": "113.965431",
      "name": "必胜客(欧洲城店)"
    },
    {
      "id": "42",
      "latitude": "22.537981",
      "locate": "广东省深圳市南山区华侨城益田假日广场B1-X4号商铺(近世界之窗)",
      "longitude": "113.973824",
      "name": "必胜客(益田假日广场店)"
    },
    {
      "id": "43",
      "latitude": "22.502947",
      "locate": "广东省深圳市南山区蛇口工业大道四海加油站右侧沃尔玛广场一层112号",
      "longitude": "113.923912",
      "name": "必胜客(四海店)"
    },
    {
      "id": "44",
      "latitude": "22.483738",
      "locate": "广东省深圳市南山区蛇口海上世界船前广场3栋1-2层",
      "longitude": "113.916214",
      "name": "必胜客(新海上世界店)"
    },
    {
      "id": "45",
      "latitude": "22.517433",
      "locate": "广东省深圳市南山区文心五路36保利文化广场B栋西北角1-2层",
      "longitude": "113.937172",
      "name": "必胜客(保利店)"
    },
    {
      "id": "46",
      "latitude": "22.516623",
      "locate": "广东省深圳市南山区创业路现代华庭1-2楼(创业路)",
      "longitude": "113.924812",
      "name": "必胜客(崇尚店)"
    },
    {
      "id": "47",
      "latitude": "22.656612",
      "locate": "广东省深圳市宝安区建设东路与东环二路交叉口星河ico购物中心内",
      "longitude": "114.038231",
      "name": "必胜客(星河ico店)"
    },
    {
      "id": "48",
      "latitude": "22.654190",
      "locate": "广东省深圳市宝安区龙华镇人民北路美丽集团大厦1楼1楼-2楼",
      "longitude": "114.021324",
      "name": "必胜客(龙华美丽店)"
    },
    {
      "id": "49",
      "latitude": "22.560740",
      "locate": "广东省深圳市宝安区海雅缤纷城负1层B1-027",
      "longitude": "113.906380",
      "name": "必胜客(海雅缤纷城店)"
    },
    {
      "id": "50",
      "latitude": "22.567217",
      "locate": "广东省深圳市宝安区10区前进路冠城世家大富豪广场1-2楼",
      "longitude": "113.905251",
      "name": "必胜客(前进店)"
    },
    {
      "id": "51",
      "latitude": "22.730062",
      "locate": "广东省深圳市宝安区沙井街道东塘社区西环路天虹购物中心1层",
      "longitude": "113.799103",
      "name": "必胜客(新沙店)"
    },
    {
      "id": "52",
      "latitude": "22.760099",
      "locate": "广东省深圳市宝安区松岗街道东方大道与松岗大道交汇处联投东方PARK内",
      "longitude": "113.859291",
      "name": "必胜客(联投东方PARK店)"
    },
    {
      "id": "53",
      "latitude": "22.782351",
      "locate": "广东省深圳市宝安区公明镇建设路56号盛妆百货必胜客",
      "longitude": "113.891457",
      "name": "必胜客(公明店)"
    },
    {
      "id": "54",
      "latitude": "22.721603",
      "locate": "广东省深圳市宝安区沙井街道中心路34-1号形色城1层118铺",
      "longitude": "113.829163",
      "name": "必胜客(沙井中心店)"
    },
    {
      "id": "55",
      "latitude": "22.732279",
      "locate": "广东省深圳市宝安区新沙路西荟城购物广场1楼",
      "longitude": "113.817116",
      "name": "必胜客(西荟城店)"
    },
    {
      "id": "56",
      "latitude": "22.767424",
      "locate": "广东省深圳市松岗佳华商场1栋1-2层",
      "longitude": "113.847748",
      "name": "必胜客(松岗店)"
    },
    {
      "id": "57",
      "latitude": "22.668505",
      "locate": "广东省深圳市宝安区福永街道福永大道边怀德东门商业中心",
      "longitude": "113.818893",
      "name": "必胜客(福永店)"
    },
    {
      "id": "58",
      "latitude": "22.568874",
      "locate": "广东省深圳市宝安区西乡街道劳动社区兴业路与悦和路交汇处七巧国(碧海店)F1",
      "longitude": "113.856773",
      "name": "必胜客(西乡富通城店)"
    },
    {
      "id": "59",
      "latitude": "22.581261",
      "locate": "广东省深圳市宝安区80区西乡街道港隆城购物中心必胜客",
      "longitude": "113.880981",
      "name": "必胜客(港隆城店)"
    },
    {
      "id": "60",
      "latitude": "22.680279",
      "locate": "广东省深圳市宝安区宝石东路宏发世纪城星城购物中心内",
      "longitude": "113.946854",
      "name": "必胜客(星城店)"
    },
    {
      "id": "61",
      "latitude": "22.722216",
      "locate": "广东省深圳市宝安区观澜街道观澜湖新城商业一层L118.L119",
      "longitude": "114.074883",
      "name": "必胜客(观澜湖店)"
    },
    {
      "id": "62",
      "latitude": "22.693289",
      "locate": "广东省深圳市宝安区观澜街道观澜大道8号芷峪澜湾花园商业裙楼一层L-54-014、负一层B-60-005",
      "longitude": "114.041008",
      "name": "必胜客(观澜店)"
    },
    {
      "id": "63",
      "latitude": "22.612549",
      "locate": "广东省深圳市龙岗区坂田街道吉华路696号嘉誉豪园1106A必胜客",
      "longitude": "114.101631",
      "name": "必胜客(坂田店)"
    },
    {
      "id": "64",
      "latitude": "22.645739",
      "locate": "广东省深圳市龙岗区坂田坂雪岗大道万科城二区29号必胜客",
      "longitude": "114.067070",
      "name": "必胜客(万科城店)"
    },
    {
      "id": "65",
      "latitude": "22.619423",
      "locate": "广东省深圳市宝安区民治民康路民治华南物流站8号仓奥特莱斯",
      "longitude": "114.055405",
      "name": "必胜客(八号仓店)"
    },
    {
      "id": "66",
      "latitude": "22.676189",
      "locate": "广东省深圳市宝安区华旺路同富裕工业园配套用房A座",
      "longitude": "113.995056",
      "name": "必胜客(大浪店)"
    },
    {
      "id": "67",
      "latitude": "22.603001",
      "locate": "广东省深圳市宝安区民治街道星河盛世商场B1001星河COCOcityL1C0291、L2C025A商铺",
      "longitude": "114.045891",
      "name": "必胜客(星河盛世店)"
    },
    {
      "id": "68",
      "latitude": "22.629072",
      "locate": "广东省深圳市宝安区人民南路与民塘路交汇处莱蒙水榭春天三期89号",
      "longitude": "114.025650",
      "name": "必胜客(水榭春天店)"
    },
    {
      "id": "69",
      "latitude": "22.597576",
      "locate": "广东省深圳市宝安区书香门第上河坊5栋2N03铺位",
      "longitude": "114.046539",
      "name": "必胜客(书香门第店)"
    },
    {
      "id": "70",
      "latitude": "22.542963",
      "locate": "广东省深圳市福田区彩德城1楼",
      "longitude": "114.069389",
      "name": "必胜客(彩德城店)"
    },
    {
      "id": "71",
      "latitude": "22.538685",
      "locate": "广东省深圳市福田区深南大道1003-2号",
      "longitude": "114.068489",
      "name": "必胜客(岗厦店)"
    },
    {
      "id": "72",
      "latitude": "22.521145",
      "locate": "广东省深圳市福田区新洲三街祥云天都世纪2层",
      "longitude": "114.043686",
      "name": "必胜客(新洲店)"
    },
    {
      "id": "73",
      "latitude": "22.544657",
      "locate": "广东省深圳市福田区农林路69号深国投广场1楼",
      "longitude": "114.012100",
      "name": "必胜客(侨香店)"
    },
    {
      "id": "74",
      "latitude": "22.523514",
      "locate": "广东省深圳市福田区福民路东方雅苑万佳百货1楼西侧",
      "longitude": "114.056915",
      "name": "必胜客(东方雅苑店)"
    },
    {
      "id": "75",
      "latitude": "22.569685",
      "locate": "广东省深圳市福田区卓悦汇购物中心二层",
      "longitude": "114.060242",
      "name": "必胜客(卓悦汇店)"
    },
    {
      "id": "76",
      "latitude": "22.541523",
      "locate": "广东省深圳市福田区深南路特区报社印刷大楼1,2楼临新闻路侧",
      "longitude": "114.045120",
      "name": "必胜客(新闻路店)"
    },
    {
      "id": "77",
      "latitude": "22.547514",
      "locate": "广东省深圳市福田区红荔中路中心书城1层夹层",
      "longitude": "114.059128",
      "name": "必胜客中心书城餐厅"
    },
    {
      "id": "78",
      "latitude": "22.535522",
      "locate": "广东省深圳市福田区福华一路3号中心城负1/2楼G010/UG005",
      "longitude": "114.060364",
      "name": "必胜客怡景中心城餐厅"
    },
    {
      "id": "79",
      "latitude": "22.565722",
      "locate": "广东省深圳市福田区梅林路梅林一村家乐福超市1层",
      "longitude": "114.040939",
      "name": "必胜客(梅林店)"
    },
    {
      "id": "80",
      "latitude": "19.528648",
      "locate": "海南省儋州市兰洋北路与伏波路交汇处(夏日广场)",
      "longitude": "109.589783",
      "name": "必胜客(夏日店)"
    },
    {
      "id": "81",
      "latitude": "18.372072",
      "locate": "海南省三亚市海棠区海棠湾经济开发区海棠湾路118号海棠湾国际购物中心三层",
      "longitude": "109.750557",
      "name": "必胜客(海棠湾店)"
    },
    {
      "id": "82",
      "latitude": "19.518793",
      "locate": "海南省儋州市万福隆商厦首层",
      "longitude": "109.570549",
      "name": "必胜客(中兴店)"
    },
    {
      "id": "83",
      "latitude": "18.296217",
      "locate": "海南省三亚市天涯区育秀路10",
      "longitude": "109.492661",
      "name": "必胜客欢乐餐厅三亚站精选快速店"
    },
    {
      "id": "84",
      "latitude": "19.510441",
      "locate": "海南省儋州市创新广场附楼1/2层",
      "longitude": "109.573090",
      "name": "必胜客(儋州创新PH店)"
    },
    {
      "id": "85",
      "latitude": "18.231424",
      "locate": "海南省三亚市吉阳区华宇百花谷商业中心E201铺",
      "longitude": "109.642746",
      "name": "必胜客(百花谷分店)"
    },
    {
      "id": "86",
      "latitude": "18.256765",
      "locate": "海南省三亚市天涯区解放路明珠广场一楼解放必胜客餐厅",
      "longitude": "109.503929",
      "name": "必胜客(明珠广场店)"
    },
    {
      "id": "87",
      "latitude": "19.098234",
      "locate": "海南省东方市解放东路南侧华人国际东方影城必胜客",
      "longitude": "108.653580",
      "name": "必胜客(东方PH店)"
    },
    {
      "id": "88",
      "latitude": "19.246847",
      "locate": "海南省琼海市琼海市海南省琼海市东风路1号东升大厦1楼",
      "longitude": "110.466370",
      "name": "必胜客(琼海东风店)"
    },
    {
      "id": "89",
      "latitude": "18.249676",
      "locate": "海南省三亚市天涯区解放路步行街屈臣氏2层",
      "longitude": "109.504242",
      "name": "必胜客(步行街店)"
    },
    {
      "id": "90",
      "latitude": "18.235233",
      "locate": "海南省三亚市吉阳区解放路时代海岸香榭左岸裙楼鸿洲渔人码头1-2层",
      "longitude": "109.509682",
      "name": "必胜客(时代海岸店)"
    },
    {
      "id": "91",
      "latitude": "18.223442",
      "locate": "海南省三亚市吉阳区吉阳区海韵路1号大东海夏日百货1层",
      "longitude": "109.522934",
      "name": "必胜客(大东海店)"
    },
    {
      "id": "92",
      "latitude": "19.978891",
      "locate": "海南省海口市秀英区万达广场1010/1011铺",
      "longitude": "110.279030",
      "name": "必胜客(海口万达店)"
    },
    {
      "id": "93",
      "latitude": "19.977747",
      "locate": "海南省海口市龙华区椰海大道384号新城吾悦广场1楼",
      "longitude": "110.341629",
      "name": "必胜客(吾悦广场店)"
    },
    {
      "id": "94",
      "latitude": "19.917027",
      "locate": "海南省海口市龙华区龙桥镇观澜湖旅游风情小镇环湖商业区X06-X1D-2114A商铺",
      "longitude": "110.333931",
      "name": "必胜客(海口观澜湖餐厅)"
    },
    {
      "id": "95",
      "latitude": "20.037874",
      "locate": "海南省海口市龙华区大同路2号友谊商业广场2楼",
      "longitude": "110.337273",
      "name": "必胜客(大同店)"
    },
    {
      "id": "96",
      "latitude": "20.029892",
      "locate": "海南省海口市美兰区海秀东路望海国际广场1/2楼",
      "longitude": "110.345726",
      "name": "必胜客(望海国际店)"
    },
    {
      "id": "97",
      "latitude": "20.030468",
      "locate": "海南省海口市美兰区海秀东路10号潮流视窗商场2层",
      "longitude": "110.343224",
      "name": "必胜客(海秀店)"
    },
    {
      "id": "98",
      "latitude": "19.977839",
      "locate": "海南省海口市龙华区迎宾路18号海口新城吾悦广场1层商铺1001,1002-2号铺面",
      "longitude": "110.341812",
      "name": "必胜客(日月广场店)"
    },
    {
      "id": "99",
      "latitude": "20.002775",
      "locate": "海南省海口市琼山区红城湖路71-6",
      "longitude": "110.347992",
      "name": "必胜客(红城湖店)"
    },
    {
      "id": "100",
      "latitude": "20.051865",
      "locate": "海南省海口市美兰区人民大道12号民博大厦2楼",
      "longitude": "110.340981",
      "name": "必胜客(三西餐厅)"
    },
    {
      "id": "101",
      "latitude": "20.028162",
      "locate": "海南省海口市龙华区玉沙路21号玉沙京华城1层A016",
      "longitude": "110.319740",
      "name": "必胜客(玉沙店)"
    },
    {
      "id": "102",
      "latitude": "20.023657",
      "locate": "海南省海口市美兰区蓝天路28号名门广场底/2层",
      "longitude": "110.351334",
      "name": "必胜客(名门广场店)"
    },
    {
      "id": "103",
      "latitude": "20.024153",
      "locate": "海南省海口市龙华区明珠路8号宜欣商业广场1楼",
      "longitude": "110.312271",
      "name": "必胜客(宜欣店)"
    },
    {
      "id": "104",
      "latitude": "21.756594",
      "locate": "广西壮族自治区防城港市防城区群星大道与二桥东路交汇处恒富商业广场1层",
      "longitude": "108.364380",
      "name": "必胜客(恒富餐厅)"
    },
    {
      "id": "105",
      "latitude": "22.794395",
      "locate": "广西壮族自治区南宁市江南区五一东路7号淡村商贸城6号楼",
      "longitude": "108.307922",
      "name": "必胜客(淡村店)"
    },
    {
      "id": "106",
      "latitude": "21.475206",
      "locate": "广西壮族自治区北海市海城区北部湾中路60号779财富中心1层",
      "longitude": "109.115036",
      "name": "必胜客(北海财富店)"
    },
    {
      "id": "107",
      "latitude": "21.966145",
      "locate": "广西壮族自治区钦州市钦南区钦州湾大道36号年年丰广场3层",
      "longitude": "108.625343",
      "name": "必胜客(年年丰PH店)"
    },
    {
      "id": "108",
      "latitude": "25.241802",
      "locate": "广西壮族自治区桂林市七星区穿山东路与环城南路交汇处桂林高新万达广场内",
      "longitude": "110.320389",
      "name": "必胜客(高新万达广场店)"
    },
    {
      "id": "109",
      "latitude": "24.408792",
      "locate": "广西壮族自治区贺州市八步区灵峰南路与江北中路江滨华府1层",
      "longitude": "111.554054",
      "name": "必胜客(贺州店)"
    },
    {
      "id": "110",
      "latitude": "25.254271",
      "locate": "广西壮族自治区桂林市象山区环城西一路117号联达商业广场1号楼1/2层",
      "longitude": "110.279800",
      "name": "必胜客(桂林联达店)"
    },
    {
      "id": "111",
      "latitude": "25.277243",
      "locate": "广西壮族自治区桂林市秀峰区中山中路33号康美大厦2楼",
      "longitude": "110.295021",
      "name": "必胜客(桂林中山店)"
    },
    {
      "id": "112",
      "latitude": "24.329973",
      "locate": "广西壮族自治区柳州市城中区东环大道256号万达广场1楼1001铺",
      "longitude": "109.440926",
      "name": "必胜客(万达PH店)"
    },
    {
      "id": "113",
      "latitude": "23.476685",
      "locate": "广西壮族自治区梧州市万秀区大学路36-1号旺城广场1-2层",
      "longitude": "111.305611",
      "name": "必胜客(梧州旺城店)"
    },
    {
      "id": "114",
      "latitude": "24.320307",
      "locate": "广西壮族自治区柳州市广场路10号地王国际财富中心f111必胜客",
      "longitude": "109.411240",
      "name": "必胜客(地王店)"
    },
    {
      "id": "115",
      "latitude": "24.303350",
      "locate": "广西壮族自治区柳州市鱼峰区飞鹅路1号谷埠街国际商城B区1层B1-114号",
      "longitude": "109.407303",
      "name": "必胜客(柳州谷埠店)"
    },
    {
      "id": "116",
      "latitude": "24.314217",
      "locate": "广西壮族自治区柳州市城中区龙城路星河大厦2层",
      "longitude": "109.411385",
      "name": "必胜客(龙城店)"
    },
    {
      "id": "117",
      "latitude": "22.868820",
      "locate": "广西壮族自治区南宁市西乡塘区高新大道以南安阳路以西安吉万达1056-1057号",
      "longitude": "108.291641",
      "name": "必胜客(安吉万达)"
    },
    {
      "id": "118",
      "latitude": "22.814875",
      "locate": "广西壮族自治区南宁市兴宁区青云街18号二层",
      "longitude": "108.321991",
      "name": "必胜客(朝阳店)"
    },
    {
      "id": "119",
      "latitude": "22.817604",
      "locate": "广西壮族自治区南宁市兴宁区西关路2号",
      "longitude": "108.319000",
      "name": "必胜客(西关店)"
    },
    {
      "id": "120",
      "latitude": "22.813704",
      "locate": "广西壮族自治区南宁市青秀区民族大道131号会展航洋城购物中心一二层",
      "longitude": "108.384666",
      "name": "必胜客(航洋国际店)"
    },
    {
      "id": "121",
      "latitude": "22.810757",
      "locate": "广西壮族自治区南宁市青秀区中越路8号盛天华府B5号楼一层01号商铺,02号商铺的部分",
      "longitude": "108.399620",
      "name": "必胜客(南宁盛天地店)"
    },
    {
      "id": "122",
      "latitude": "22.812504",
      "locate": "广西壮族自治区南宁市青秀区华润万象城B118号商铺",
      "longitude": "108.392517",
      "name": "必胜客(万象城店)"
    },
    {
      "id": "123",
      "latitude": "22.830757",
      "locate": "广西壮族自治区南宁市青秀区东葛路118号万达广场1楼1030B1031号商铺、2楼2031号商铺",
      "longitude": "108.370575",
      "name": "必胜客(青秀万达餐厅)"
    },
    {
      "id": "124",
      "latitude": "22.825451",
      "locate": "广西壮族自治区南宁市青秀区东葛路82号1-2层",
      "longitude": "108.353706",
      "name": "必胜客(东葛店)"
    },
    {
      "id": "125",
      "latitude": "22.832153",
      "locate": "广西壮族自治区南宁市西乡塘区大学东路98号南宁百货新世界店1/2楼",
      "longitude": "108.291779",
      "name": "必胜客(世贸西城店)"
    },
    {
      "id": "126",
      "latitude": "22.275541",
      "locate": "广东省珠海市香洲区凤凰南路1066号扬名广场负一层B1016-B1019",
      "longitude": "113.579872",
      "name": "必胜客(扬名店)"
    },
    {
      "id": "127",
      "latitude": "22.247053",
      "locate": "广东省珠海市香洲区前山明珠南路1999号二城广场一、二层必胜客",
      "longitude": "113.519859",
      "name": "必胜客(明珠店)"
    },
    {
      "id": "128",
      "latitude": "22.267046",
      "locate": "广东省珠海市香洲区新香洲星园路3号仁恒星园商业街",
      "longitude": "113.533974",
      "name": "必胜客(仁恒店)"
    },
    {
      "id": "129",
      "latitude": "22.254774",
      "locate": "广东省珠海市香洲区吉大景山路国营外币免税商场首层",
      "longitude": "113.580460",
      "name": "必胜客(免税商场店)"
    },
    {
      "id": "130",
      "latitude": "22.274956",
      "locate": "广东省珠海市香洲区明珠北路338号乐世界购物中心一、二层F103、F202",
      "longitude": "113.509308",
      "name": "必胜客(山姆店)"
    },
    {
      "id": "131",
      "latitude": "22.234964",
      "locate": "广东省珠海市香洲区中海富华里中心之7栋一层102、103、104、105  号商铺",
      "longitude": "113.541336",
      "name": "必胜客(富华里店)"
    },
    {
      "id": "132",
      "latitude": "22.225126",
      "locate": "广东省珠海市香洲区珠海大道8号华发商都B馆1楼必胜客",
      "longitude": "113.512459",
      "name": "必胜客(华发店)"
    },
    {
      "id": "133",
      "latitude": "22.223244",
      "locate": "广东省珠海市香洲区迎宾南路1144号迎宾广场2楼",
      "longitude": "113.553505",
      "name": "必胜客(迎宾店)"
    },
    {
      "id": "134",
      "latitude": "22.568874",
      "locate": "广东省深圳市宝安区西乡街道劳动社区兴业路与悦和路交汇处七巧国(碧海店)F1",
      "longitude": "113.856766",
      "name": "必胜客(西乡富通城店)"
    }
  ]
};